Revit 2027 API
FabricationConfiguration.GetDamperName Method
 Gets the damper name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetDamperName(
	int damperId
)
Public Function GetDamperName (
	damperId As Integer
) As String
public:
String^ GetDamperName(
	int damperId
)
member GetDamperName :
        damperId : int -> string
Parameters
damperId Int32
 The damper identifier.
Return Value
String
 The damper name.
Exceptions
Exception | Condition
ArgumentException |  The damper does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace